{
    "ancestor_a": {
        "default": null,
        "maxlength": 32,
        "meta": {
            "description": "The signature of the closest surviving (in this genetic material store or higher) ancestor of the primary parent of this GC i.e. the one that contributed the most genetic code. None for codons."
        },
        "minlength": 32,
        "nullable": true,
        "type": "binary"
    },
    "ancestor_b": {
        "default": null,
        "maxlength": 32,
        "meta": {
            "description": "The signature of the closest surviving (in this genetic material store or higher) ancestor of the secondary parent of this GC i.e. the one that contributed the least genetic code. None for GC's asexually evolved."
        },
        "minlength": 32,
        "nullable": true,
        "type": "binary"
    },
    "creator": {
        "default": null,
        "meta": {
            "description": "The UUID identifying the creator. If the genetic code has been created in another microbiome at an earlier time then this field will be updated."
        },
        "type": "uuid"
    },
    "gca": {
        "default": null,
        "maxlength": 32,
        "meta": {
            "description": "The signature of Genetic Code A or NULL if this genetic code is a codon. Its connectivity to the Inputs, Constants, genetic code B and outputs are defined in the 'graph'."
        },
        "minlength": 32,
        "nullable": true,
        "type": "binary"
    },
    "gcb": {
        "default": null,
        "maxlength": 32,
        "meta": {
            "description": "The signature of Genetic Code B or NULL if it is not connected to anything. Connectivity to the Inputs, Constants, genetic code A and outputs are defined in the 'graph'."
        },
        "minlength": 32,
        "nullable": true,
        "type": "binary"
    },
    "pgc": {
        "default": null,
        "maxlength": 32,
        "meta": {
            "description": "The physical GC that created this GC."
        },
        "minlength": 32,
        "nullable": true,
        "type": "binary"
    },
    "signature": {
        "required": true,
        "maxlength": 32,
        "meta": {
            "description": "Unique identifier for this genetic code dervived from its essential characteristics."
        },
        "minlength": 32,
        "type": "binary",
        "default_setter": "set_signature"
    },
    "sms": {
        "default": null,
        "maxlength": 32,
        "meta": {
            "description": "The signature of the Super Mutation Sequence that created this GC, if any."
        },
        "minlength": 32,
        "nullable": true,
        "type": "binary"
    }
}